export default {
  "/01.指南/": [
    {
      text: "简介",
      items: [{ text: "简介", link: "/01.指南/index" }],
    },
    {
      text: "使用",
      items: [
        {
          text: "登录认证",
          link: "/01.指南/01.指南 - 使用/04.使用 - 登录认证",
        },
        {
          text: "权限认证",
          link: "/01.指南/01.指南 - 使用/07.使用 - 权限认证",
        },
        {
          text: "登出下线",
          link: "/01.指南/01.指南 - 使用/10.使用 - 登出下线",
        },
        {
          text: "注解鉴权",
          link: "/01.指南/01.指南 - 使用/13.使用 - 注解鉴权",
        },
        {
          text: "路由拦截鉴权",
          link: "/01.指南/01.指南 - 使用/16.使用 - 路由拦截鉴权",
        },
        {
          text: "Session 会话",
          link: "/01.指南/01.指南 - 使用/19.使用 - Session 会话",
        },
        {
          text: "框架配置",
          link: "/01.指南/01.指南 - 使用/22.使用 - 框架配置",
        },
        {
          text: "自定义 Token",
          link: "/01.指南/01.指南 - 使用/25.使用 - 自定义 Token",
        },
        {
          text: "临时 Token 认证",
          link: "/01.指南/01.指南 - 使用/28.使用 - 临时 Token 认证",
        },
        {
          text: "记住我模式",
          link: "/01.指南/01.指南 - 使用/31.使用 - 记住我模式",
        },
        {
          text: "二级认证",
          link: "/01.指南/01.指南 - 使用/34.使用 - 二级认证",
        },
        {
          text: "身份切换",
          link: "/01.指南/01.指南 - 使用/37.使用 - 身份切换",
        },
        {
          text: "账号封禁",
          link: "/01.指南/01.指南 - 使用/40.使用 - 账号封禁",
        },
        {
          text: "会话查询",
          link: "/01.指南/01.指南 - 使用/43.使用 - 会话查询",
        },
        {
          text: "Http Basic 认证",
          link: "/01.指南/01.指南 - 使用/46.使用 - Http Basic 认证",
        },
        {
          text: "全局侦听器",
          link: "/01.指南/01.指南 - 使用/49.使用 - 全局侦听器",
        },
        {
          text: "全局过滤器",
          link: "/01.指南/01.指南 - 使用/52.使用 - 全局过滤器",
        },
        {
          text: "多账号认证",
          link: "/01.指南/01.指南 - 使用/55.使用 - 多账号认证",
        },
        {
          text: "自定义注解",
          link: "/01.指南/01.指南 - 使用/58.使用 - 自定义注解",
        },
      ],
    },
    {
      text: "环境",
      items: [
        {
          text: "集成 Spring Boot",
          link: "/01.指南/05.指南 - 环境集成/04.环境集成 - Spring Boot",
        },
        {
          text: "集成 WebFlux",
          link: "/01.指南/05.指南 - 环境集成/07.环境集成 - Spring WebFlux",
        },
        {
          text: "上下文组件开发指南",
          link: "/01.指南/05.指南 - 环境集成/99.环境集成 - 上下文组件开发指南",
        },
      ],
    },
    {
      text: "插件",
      items: [
        {
          text: "持久层集成 Redis",
          link: "/01.指南/10.指南 - 插件/04.插件 - 持久层集成 Redis",
        },
        {
          text: "持久层拓展",
          link: "/01.指南/10.指南 - 插件/07.插件 - 持久层拓展",
        },
        {
          text: "AOP 注解鉴权",
          link: "/01.指南/10.指南 - 插件/10.插件 - AOP 注解鉴权",
        },
        {
          text: "Token 集成 JWT",
          link: "/01.指南/10.指南 - 插件/13.插件 - Token 集成 JWT",
        },
        {
          text: "插件开发指南",
          link: "/01.指南/10.指南 - 插件/99.插件 - 插件开发指南",
        },
      ],
    },
  ],
  "/05.设计/": [
    {
      text: "思路",
      items: [{ text: "思路设计", link: "/05.设计/01.设计 - 思路/01.设计 - 思路设计" }],
    },
  ],
};
